; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite1 - satellite
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	instrument8 - instrument
	satellite4 - satellite
	instrument9 - instrument
	instrument10 - instrument
	instrument11 - instrument
	spectrograph0 - mode
	spectrograph1 - mode
	infrared3 - mode
	thermograph4 - mode
	spectrograph2 - mode
	GroundStation4 - direction
	Star15 - direction
	GroundStation17 - direction
	GroundStation26 - direction
	GroundStation34 - direction
	Star35 - direction
	Star39 - direction
	GroundStation42 - direction
	Star43 - direction
	GroundStation46 - direction
	Star47 - direction
	GroundStation48 - direction
	GroundStation5 - direction
	Star13 - direction
	Star10 - direction
	GroundStation21 - direction
	GroundStation14 - direction
	Star20 - direction
	GroundStation16 - direction
	GroundStation12 - direction
	GroundStation28 - direction
	GroundStation27 - direction
	GroundStation44 - direction
	Star7 - direction
	Star19 - direction
	Star0 - direction
	Star11 - direction
	Star23 - direction
	Star45 - direction
	GroundStation33 - direction
	Star29 - direction
	GroundStation2 - direction
	GroundStation36 - direction
	GroundStation37 - direction
	Star38 - direction
	Star32 - direction
	Star8 - direction
	Star41 - direction
	Star40 - direction
	Star1 - direction
	GroundStation22 - direction
	GroundStation31 - direction
	GroundStation9 - direction
	Star30 - direction
	Star6 - direction
	Star25 - direction
	GroundStation18 - direction
	GroundStation24 - direction
	GroundStation49 - direction
	GroundStation3 - direction
	Star50 - direction
	Star51 - direction
	Star52 - direction
	Phenomenon53 - direction
	Star54 - direction
	Planet55 - direction
	Star56 - direction
	Star57 - direction
	Star58 - direction
	Planet59 - direction
	Planet60 - direction
	Planet61 - direction
	Star62 - direction
	Planet63 - direction
	Star64 - direction
	Planet65 - direction
	Planet66 - direction
	Planet67 - direction
	Planet68 - direction
	Star69 - direction
	Phenomenon70 - direction
	Phenomenon71 - direction
	Planet72 - direction
	Planet73 - direction
	Phenomenon74 - direction
	Planet75 - direction
	Star76 - direction
	Phenomenon77 - direction
	Phenomenon78 - direction
	Planet79 - direction
	Planet80 - direction
	Phenomenon81 - direction
	Star82 - direction
	Phenomenon83 - direction
	Star84 - direction
)
(:init
	(supports instrument0 spectrograph2)
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 Star45)
	(calibration_target instrument0 GroundStation22)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 Star20)
	(calibration_target instrument1 GroundStation3)
	(calibration_target instrument1 Star19)
	(calibration_target instrument1 Star23)
	(calibration_target instrument1 GroundStation28)
	(calibration_target instrument1 GroundStation37)
	(calibration_target instrument1 Star13)
	(calibration_target instrument1 GroundStation9)
	(calibration_target instrument1 GroundStation5)
	(calibration_target instrument1 GroundStation31)
	(calibration_target instrument1 Star6)
	(calibration_target instrument1 GroundStation24)
	(calibration_target instrument1 GroundStation14)
	(supports instrument2 infrared3)
	(supports instrument2 spectrograph0)
	(calibration_target instrument2 GroundStation14)
	(calibration_target instrument2 GroundStation33)
	(calibration_target instrument2 GroundStation21)
	(calibration_target instrument2 Star10)
	(supports instrument3 infrared3)
	(supports instrument3 spectrograph2)
	(supports instrument3 thermograph4)
	(calibration_target instrument3 Star20)
	(calibration_target instrument3 GroundStation28)
	(calibration_target instrument3 GroundStation16)
	(calibration_target instrument3 Star38)
	(calibration_target instrument3 GroundStation27)
	(calibration_target instrument3 GroundStation3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(on_board instrument3 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet65)
	(supports instrument4 spectrograph1)
	(calibration_target instrument4 GroundStation33)
	(calibration_target instrument4 GroundStation16)
	(calibration_target instrument4 GroundStation2)
	(calibration_target instrument4 GroundStation28)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star45)
	(supports instrument5 infrared3)
	(calibration_target instrument5 GroundStation24)
	(calibration_target instrument5 Star6)
	(calibration_target instrument5 GroundStation44)
	(calibration_target instrument5 GroundStation28)
	(calibration_target instrument5 Star25)
	(calibration_target instrument5 GroundStation12)
	(calibration_target instrument5 Star30)
	(supports instrument6 spectrograph2)
	(calibration_target instrument6 Star7)
	(calibration_target instrument6 GroundStation37)
	(calibration_target instrument6 GroundStation36)
	(calibration_target instrument6 Star11)
	(calibration_target instrument6 Star6)
	(calibration_target instrument6 GroundStation2)
	(calibration_target instrument6 GroundStation44)
	(calibration_target instrument6 GroundStation31)
	(calibration_target instrument6 GroundStation27)
	(calibration_target instrument6 GroundStation18)
	(calibration_target instrument6 Star0)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation48)
	(supports instrument7 infrared3)
	(calibration_target instrument7 Star11)
	(calibration_target instrument7 Star1)
	(calibration_target instrument7 Star19)
	(calibration_target instrument7 GroundStation2)
	(calibration_target instrument7 Star0)
	(calibration_target instrument7 GroundStation9)
	(calibration_target instrument7 Star45)
	(supports instrument8 spectrograph2)
	(calibration_target instrument8 GroundStation37)
	(calibration_target instrument8 GroundStation36)
	(calibration_target instrument8 GroundStation18)
	(calibration_target instrument8 GroundStation22)
	(calibration_target instrument8 GroundStation9)
	(calibration_target instrument8 GroundStation2)
	(calibration_target instrument8 GroundStation31)
	(calibration_target instrument8 Star29)
	(calibration_target instrument8 GroundStation33)
	(calibration_target instrument8 Star45)
	(calibration_target instrument8 Star23)
	(calibration_target instrument8 Star11)
	(calibration_target instrument8 Star38)
	(calibration_target instrument8 Star0)
	(calibration_target instrument8 Star6)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star35)
	(supports instrument9 spectrograph0)
	(calibration_target instrument9 Star32)
	(calibration_target instrument9 Star1)
	(calibration_target instrument9 Star40)
	(calibration_target instrument9 Star38)
	(supports instrument10 spectrograph0)
	(supports instrument10 spectrograph2)
	(supports instrument10 thermograph4)
	(calibration_target instrument10 GroundStation24)
	(calibration_target instrument10 GroundStation18)
	(calibration_target instrument10 Star25)
	(calibration_target instrument10 Star6)
	(calibration_target instrument10 GroundStation3)
	(calibration_target instrument10 Star30)
	(calibration_target instrument10 GroundStation9)
	(calibration_target instrument10 GroundStation31)
	(calibration_target instrument10 GroundStation49)
	(calibration_target instrument10 GroundStation22)
	(calibration_target instrument10 Star1)
	(calibration_target instrument10 Star40)
	(calibration_target instrument10 Star41)
	(calibration_target instrument10 Star8)
	(supports instrument11 spectrograph1)
	(supports instrument11 thermograph4)
	(calibration_target instrument11 GroundStation3)
	(calibration_target instrument11 GroundStation49)
	(on_board instrument9 satellite4)
	(on_board instrument10 satellite4)
	(on_board instrument11 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star50)
)
(:goal (and
	(have_image Star50 spectrograph2)
	(have_image Star51 spectrograph1)
	(have_image Star52 spectrograph1)
	(have_image Phenomenon53 spectrograph2)
	(have_image Star54 spectrograph2)
	(have_image Planet55 spectrograph2)
	(have_image Star56 thermograph4)
	(have_image Star57 infrared3)
	(have_image Star58 infrared3)
	(have_image Planet59 spectrograph0)
	(have_image Planet60 spectrograph0)
	(have_image Planet61 spectrograph0)
	(have_image Star62 infrared3)
	(have_image Planet63 spectrograph0)
	(have_image Star64 spectrograph2)
	(have_image Planet65 spectrograph2)
	(have_image Planet66 spectrograph2)
	(have_image Planet67 infrared3)
	(have_image Planet68 thermograph4)
	(have_image Star69 spectrograph0)
	(have_image Phenomenon70 spectrograph1)
	(have_image Phenomenon71 spectrograph1)
	(have_image Planet72 thermograph4)
	(have_image Planet73 spectrograph1)
	(have_image Phenomenon74 infrared3)
	(have_image Planet75 spectrograph1)
	(have_image Star76 spectrograph1)
	(have_image Phenomenon77 spectrograph0)
	(have_image Phenomenon78 thermograph4)
	(have_image Planet79 spectrograph2)
	(have_image Planet80 spectrograph1)
	(have_image Phenomenon81 thermograph4)
	(have_image Star82 spectrograph0)
	(have_image Phenomenon83 spectrograph1)
	(have_image Star84 spectrograph0)
))

)

; plan
1. (switch_on instrument10 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument10)
   goals met: 0 of 35
2. (switch_on instrument4 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument4)
   goals met: 0 of 35
3. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 0 of 35
4. (turn_to satellite1 groundstation33 star45)
   deleted: (pointing satellite1 star45)
   added: (pointing satellite1 groundstation33)
   goals met: 0 of 35
5. (calibrate satellite1 instrument4 groundstation33)
   added: (calibrated instrument4)
   goals met: 0 of 35
6. (turn_to satellite1 phenomenon70 groundstation33)
   deleted: (pointing satellite1 groundstation33)
   added: (pointing satellite1 phenomenon70)
   goals met: 0 of 35
7. (take_image satellite1 phenomenon70 instrument4 spectrograph1)
   added: (have_image phenomenon70 spectrograph1)
   goals met: 1 of 35
8. (turn_to satellite1 phenomenon71 phenomenon70)
   deleted: (pointing satellite1 phenomenon70)
   added: (pointing satellite1 phenomenon71)
   goals met: 1 of 35
9. (take_image satellite1 phenomenon71 instrument4 spectrograph1)
   added: (have_image phenomenon71 spectrograph1)
   goals met: 2 of 35
10. (turn_to satellite1 phenomenon83 phenomenon71)
   deleted: (pointing satellite1 phenomenon71)
   added: (pointing satellite1 phenomenon83)
   goals met: 2 of 35
11. (take_image satellite1 phenomenon83 instrument4 spectrograph1)
   added: (have_image phenomenon83 spectrograph1)
   goals met: 3 of 35
12. (turn_to satellite1 planet73 phenomenon83)
   deleted: (pointing satellite1 phenomenon83)
   added: (pointing satellite1 planet73)
   goals met: 3 of 35
13. (take_image satellite1 planet73 instrument4 spectrograph1)
   added: (have_image planet73 spectrograph1)
   goals met: 4 of 35
14. (turn_to satellite1 planet75 planet73)
   deleted: (pointing satellite1 planet73)
   added: (pointing satellite1 planet75)
   goals met: 4 of 35
15. (take_image satellite1 planet75 instrument4 spectrograph1)
   added: (have_image planet75 spectrograph1)
   goals met: 5 of 35
16. (turn_to satellite1 planet80 planet75)
   deleted: (pointing satellite1 planet75)
   added: (pointing satellite1 planet80)
   goals met: 5 of 35
17. (take_image satellite1 planet80 instrument4 spectrograph1)
   added: (have_image planet80 spectrograph1)
   goals met: 6 of 35
18. (turn_to satellite1 star51 planet80)
   deleted: (pointing satellite1 planet80)
   added: (pointing satellite1 star51)
   goals met: 6 of 35
19. (take_image satellite1 star51 instrument4 spectrograph1)
   added: (have_image star51 spectrograph1)
   goals met: 7 of 35
20. (turn_to satellite1 star52 star51)
   deleted: (pointing satellite1 star51)
   added: (pointing satellite1 star52)
   goals met: 7 of 35
21. (take_image satellite1 star52 instrument4 spectrograph1)
   added: (have_image star52 spectrograph1)
   goals met: 8 of 35
22. (turn_to satellite1 star76 star52)
   deleted: (pointing satellite1 star52)
   added: (pointing satellite1 star76)
   goals met: 8 of 35
23. (take_image satellite1 star76 instrument4 spectrograph1)
   added: (have_image star76 spectrograph1)
   goals met: 9 of 35
24. (turn_to satellite0 phenomenon74 planet65)
   deleted: (pointing satellite0 planet65)
   added: (pointing satellite0 phenomenon74)
   goals met: 9 of 35
25. (turn_to satellite4 star8 star50)
   deleted: (pointing satellite4 star50)
   added: (pointing satellite4 star8)
   goals met: 9 of 35
26. (calibrate satellite4 instrument10 star8)
   added: (calibrated instrument10)
   goals met: 9 of 35
27. (turn_to satellite4 phenomenon53 star8)
   deleted: (pointing satellite4 star8)
   added: (pointing satellite4 phenomenon53)
   goals met: 9 of 35
28. (take_image satellite4 phenomenon53 instrument10 spectrograph2)
   added: (have_image phenomenon53 spectrograph2)
   goals met: 10 of 35
29. (turn_to satellite4 phenomenon77 phenomenon53)
   deleted: (pointing satellite4 phenomenon53)
   added: (pointing satellite4 phenomenon77)
   goals met: 10 of 35
30. (take_image satellite4 phenomenon77 instrument10 spectrograph0)
   added: (have_image phenomenon77 spectrograph0)
   goals met: 11 of 35
31. (turn_to satellite4 phenomenon78 phenomenon77)
   deleted: (pointing satellite4 phenomenon77)
   added: (pointing satellite4 phenomenon78)
   goals met: 11 of 35
32. (take_image satellite4 phenomenon78 instrument10 thermograph4)
   added: (have_image phenomenon78 thermograph4)
   goals met: 12 of 35
33. (turn_to satellite4 phenomenon81 phenomenon78)
   deleted: (pointing satellite4 phenomenon78)
   added: (pointing satellite4 phenomenon81)
   goals met: 12 of 35
34. (take_image satellite4 phenomenon81 instrument10 thermograph4)
   added: (have_image phenomenon81 thermograph4)
   goals met: 13 of 35
35. (turn_to satellite4 planet55 phenomenon81)
   deleted: (pointing satellite4 phenomenon81)
   added: (pointing satellite4 planet55)
   goals met: 13 of 35
36. (take_image satellite4 planet55 instrument10 spectrograph2)
   added: (have_image planet55 spectrograph2)
   goals met: 14 of 35
37. (turn_to satellite4 planet59 planet55)
   deleted: (pointing satellite4 planet55)
   added: (pointing satellite4 planet59)
   goals met: 14 of 35
38. (take_image satellite4 planet59 instrument10 spectrograph0)
   added: (have_image planet59 spectrograph0)
   goals met: 15 of 35
39. (turn_to satellite4 planet60 planet59)
   deleted: (pointing satellite4 planet59)
   added: (pointing satellite4 planet60)
   goals met: 15 of 35
40. (take_image satellite4 planet60 instrument10 spectrograph0)
   added: (have_image planet60 spectrograph0)
   goals met: 16 of 35
41. (turn_to satellite4 planet61 planet60)
   deleted: (pointing satellite4 planet60)
   added: (pointing satellite4 planet61)
   goals met: 16 of 35
42. (take_image satellite4 planet61 instrument10 spectrograph0)
   added: (have_image planet61 spectrograph0)
   goals met: 17 of 35
43. (turn_to satellite4 planet63 planet61)
   deleted: (pointing satellite4 planet61)
   added: (pointing satellite4 planet63)
   goals met: 17 of 35
44. (take_image satellite4 planet63 instrument10 spectrograph0)
   added: (have_image planet63 spectrograph0)
   goals met: 18 of 35
45. (turn_to satellite4 planet65 planet63)
   deleted: (pointing satellite4 planet63)
   added: (pointing satellite4 planet65)
   goals met: 18 of 35
46. (take_image satellite4 planet65 instrument10 spectrograph2)
   added: (have_image planet65 spectrograph2)
   goals met: 19 of 35
47. (turn_to satellite4 planet66 planet65)
   deleted: (pointing satellite4 planet65)
   added: (pointing satellite4 planet66)
   goals met: 19 of 35
48. (take_image satellite4 planet66 instrument10 spectrograph2)
   added: (have_image planet66 spectrograph2)
   goals met: 20 of 35
49. (turn_to satellite4 planet68 planet66)
   deleted: (pointing satellite4 planet66)
   added: (pointing satellite4 planet68)
   goals met: 20 of 35
50. (take_image satellite4 planet68 instrument10 thermograph4)
   added: (have_image planet68 thermograph4)
   goals met: 21 of 35
51. (turn_to satellite4 planet72 planet68)
   deleted: (pointing satellite4 planet68)
   added: (pointing satellite4 planet72)
   goals met: 21 of 35
52. (take_image satellite4 planet72 instrument10 thermograph4)
   added: (have_image planet72 thermograph4)
   goals met: 22 of 35
53. (turn_to satellite4 planet79 planet72)
   deleted: (pointing satellite4 planet72)
   added: (pointing satellite4 planet79)
   goals met: 22 of 35
54. (take_image satellite4 planet79 instrument10 spectrograph2)
   added: (have_image planet79 spectrograph2)
   goals met: 23 of 35
55. (turn_to satellite4 star50 planet79)
   deleted: (pointing satellite4 planet79)
   added: (pointing satellite4 star50)
   goals met: 23 of 35
56. (take_image satellite4 star50 instrument10 spectrograph2)
   added: (have_image star50 spectrograph2)
   goals met: 24 of 35
57. (turn_to satellite4 star54 star50)
   deleted: (pointing satellite4 star50)
   added: (pointing satellite4 star54)
   goals met: 24 of 35
58. (take_image satellite4 star54 instrument10 spectrograph2)
   added: (have_image star54 spectrograph2)
   goals met: 25 of 35
59. (turn_to satellite4 star56 star54)
   deleted: (pointing satellite4 star54)
   added: (pointing satellite4 star56)
   goals met: 25 of 35
60. (take_image satellite4 star56 instrument10 thermograph4)
   added: (have_image star56 thermograph4)
   goals met: 26 of 35
61. (turn_to satellite4 star64 star56)
   deleted: (pointing satellite4 star56)
   added: (pointing satellite4 star64)
   goals met: 26 of 35
62. (take_image satellite4 star64 instrument10 spectrograph2)
   added: (have_image star64 spectrograph2)
   goals met: 27 of 35
63. (turn_to satellite4 star69 star64)
   deleted: (pointing satellite4 star64)
   added: (pointing satellite4 star69)
   goals met: 27 of 35
64. (take_image satellite4 star69 instrument10 spectrograph0)
   added: (have_image star69 spectrograph0)
   goals met: 28 of 35
65. (turn_to satellite4 star82 star69)
   deleted: (pointing satellite4 star69)
   added: (pointing satellite4 star82)
   goals met: 28 of 35
66. (take_image satellite4 star82 instrument10 spectrograph0)
   added: (have_image star82 spectrograph0)
   goals met: 29 of 35
67. (turn_to satellite4 star84 star82)
   deleted: (pointing satellite4 star82)
   added: (pointing satellite4 star84)
   goals met: 29 of 35
68. (take_image satellite4 star84 instrument10 spectrograph0)
   added: (have_image star84 spectrograph0)
   goals met: 30 of 35
69. (turn_to satellite0 star10 phenomenon74)
   deleted: (pointing satellite0 phenomenon74)
   added: (pointing satellite0 star10)
   goals met: 30 of 35
70. (calibrate satellite0 instrument2 star10)
   added: (calibrated instrument2)
   goals met: 30 of 35
71. (turn_to satellite0 phenomenon74 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 phenomenon74)
   goals met: 30 of 35
72. (take_image satellite0 phenomenon74 instrument2 infrared3)
   added: (have_image phenomenon74 infrared3)
   goals met: 31 of 35
73. (turn_to satellite0 planet67 phenomenon74)
   deleted: (pointing satellite0 phenomenon74)
   added: (pointing satellite0 planet67)
   goals met: 31 of 35
74. (take_image satellite0 planet67 instrument2 infrared3)
   added: (have_image planet67 infrared3)
   goals met: 32 of 35
75. (turn_to satellite0 star57 planet67)
   deleted: (pointing satellite0 planet67)
   added: (pointing satellite0 star57)
   goals met: 32 of 35
76. (take_image satellite0 star57 instrument2 infrared3)
   added: (have_image star57 infrared3)
   goals met: 33 of 35
77. (turn_to satellite0 star58 star57)
   deleted: (pointing satellite0 star57)
   added: (pointing satellite0 star58)
   goals met: 33 of 35
78. (take_image satellite0 star58 instrument2 infrared3)
   added: (have_image star58 infrared3)
   goals met: 34 of 35
79. (turn_to satellite0 star62 star58)
   deleted: (pointing satellite0 star58)
   added: (pointing satellite0 star62)
   goals met: 34 of 35
80. (take_image satellite0 star62 instrument2 infrared3)
   added: (have_image star62 infrared3)
   goals met: 35 of 35
